Overload List
Name  |   Description
AppendShape(IList GeometryObject )
 Appends the collection of Geometry objects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder)
 Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList GeometryObject , DirectShapeTargetViewType)
 Appends the collection of Geometry objects into the model or view specific shape representation stored in this DirectShape. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
 See Also
  DirectShape Class
  DirectShape Members
  Autodesk.Revit.DB Namespace